{
  "tokens": [
    "#",
    "$",
    "%",
    "(",
    ")",
    "*",
    "+",
    "-",
    ".",
    "/",
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    ":",
    "<",
    "<EOS>",
    "<PAD>",
    "<SOS>",
    "<UNK>",
    "=",
    ">",
    "?",
    "@",
    "Ac",
    "Ag",
    "Al",
    "Am",
    "Ar",
    "As",
    "At",
    "Au",
    "B",
    "Ba",
    "Be",
    "Bh",
    "Bi",
    "Bk",
    "Br",
    "C",
    "Ca",
    "Cd",
    "Ce",
    "Cf",
    "Cl",
    "Cm",
    "Cn",
    "Co",
    "Cr",
    "Cs",
    "Cu",
    "Db",
    "Ds",
    "Dy",
    "Er",
    "Es",
    "Eu",
    "F",
    "Fe",
    "Fl",
    "Fm",
    "Fr",
    "Ga",
    "Gd",
    "Ge",
    "H",
    "He",
    "Hf",
    "Hg",
    "Ho",
    "Hs",
    "I",
    "In",
    "Ir",
    "K",
    "Kr",
    "La",
    "Li",
    "Lr",
    "Lu",
    "Lv",
    "Md",
    "Mg",
    "Mn",
    "Mo",
    "Mt",
    "N",
    "Na",
    "Nb",
    "Nd",
    "Ne",
    "Ni",
    "No",
    "Np",
    "O",
    "Og",
    "Os",
    "P",
    "Pa",
    "Pb",
    "Pd",
    "Pm",
    "Po",
    "Pr",
    "Pt",
    "Pu",
    "Ra",
    "Rb",
    "Re",
    "Rf",
    "Rg",
    "Rh",
    "Rn",
    "Ru",
    "S",
    "Sb",
    "Sc",
    "Se",
    "Sg",
    "Si",
    "Sm",
    "Sn",
    "Sr",
    "Ta",
    "Tb",
    "Tc",
    "Te",
    "Th",
    "Ti",
    "Tl",
    "Tm",
    "Ts",
    "U",
    "V",
    "W",
    "Xe",
    "Y",
    "Yb",
    "Zn",
    "Zr",
    "[11CH3]",
    "[11CH4]",
    "[123I-]",
    "[125I]",
    "[131I]",
    "[13CH4]",
    "[13NH3]",
    "[13c]",
    "[14C]",
    "[15OH2]",
    "[17O]",
    "[18FH]",
    "[18F]",
    "[1HH]",
    "[2H-]",
    "[2H]",
    "[32P]",
    "[3H]",
    "[60Co]",
    "[99Tc+4]",
    "[99Tc]",
    "[Ag+2]",
    "[Ag+3]",
    "[Ag+]",
    "[Ag-]",
    "[Ag]",
    "[Al+2]",
    "[Al+3]",
    "[Al+]",
    "[Al-3]",
    "[Al-]",
    "[AlH-]",
    "[AlH2+]",
    "[AlH2-]",
    "[AlH3]",
    "[AlH4-]",
    "[AlH]",
    "[Al]",
    "[Ar]",
    "[As+3]",
    "[As+]",
    "[As-]",
    "[AsH+]",
    "[AsH2]",
    "[AsH3]",
    "[AsH4+]",
    "[AsH]",
    "[As]",
    "[At]",
    "[Au+3]",
    "[Au+]",
    "[Au-]",
    "[Au]",
    "[B+2]",
    "[B+3]",
    "[B+]",
    "[B-]",
    "[B@-]",
    "[B@@-]",
    "[BH-]",
    "[BH2-]",
    "[BH3-]",
    "[BH4-]",
    "[BH]",
    "[B]",
    "[Ba+2]",
    "[Ba]",
    "[Be+2]",
    "[Bi+2]",
    "[Bi+3]",
    "[Bi+]",
    "[BiH3]",
    "[Bi]",
    "[Br+2]",
    "[Br+]",
    "[Br-]",
    "[BrH+]",
    "[Br]",
    "[C+4]",
    "[C+]",
    "[C-]",
    "[C@@H]",
    "[C@@]",
    "[C@H]",
    "[C@]",
    "[CH+]",
    "[CH-]",
    "[CH2+]",
    "[CH2-]",
    "[CH2]",
    "[CH3+3]",
    "[CH3+]",
    "[CH3-]",
    "[CH]",
    "[C]",
    "[Ca+2]",
    "[Ca]",
    "[Cd+2]",
    "[Cd+]",
    "[Cd]",
    "[Ce+2]",
    "[Ce+3]",
    "[Ce+4]",
    "[Ce]",
    "[Cl+2]",
    "[Cl+3]",
    "[Cl+]",
    "[Cl-]",
    "[ClH+]",
    "[Cl]",
    "[Co+2]",
    "[Co+3]",
    "[Co+]",
    "[Co]",
    "[Cr+2]",
    "[Cr+3]",
    "[Cr+4]",
    "[Cr+6]",
    "[Cr-]",
    "[Cr]",
    "[Cs+]",
    "[Cs]",
    "[Cu+2]",
    "[Cu+3]",
    "[Cu+4]",
    "[Cu+]",
    "[Cu-2]",
    "[Cu-]",
    "[Cu]",
    "[Dy+3]",
    "[Dy]",
    "[Er+3]",
    "[Eu+3]",
    "[Eu]",
    "[F-]",
    "[F]",
    "[Fe+2]",
    "[Fe+3]",
    "[Fe+4]",
    "[Fe+6]",
    "[Fe+]",
    "[Fe-3]",
    "[Fe-4]",
    "[Fe]",
    "[Ga+2]",
    "[Ga+3]",
    "[Ga+]",
    "[Ga]",
    "[Gd+3]",
    "[Gd]",
    "[Ge+2]",
    "[Ge+3]",
    "[GeH2]",
    "[GeH3]",
    "[GeH]",
    "[Ge]",
    "[H+]",
    "[H-]",
    "[H]",
    "[HeH]",
    "[He]",
    "[Hf+2]",
    "[Hf+3]",
    "[Hf+4]",
    "[Hf]",
    "[Hg+2]",
    "[Hg+]",
    "[Hg]",
    "[I+2]",
    "[I+3]",
    "[I+]",
    "[I-]",
    "[IH+]",
    "[IH2+]",
    "[IH]",
    "[I]",
    "[In+3]",
    "[In+]",
    "[In]",
    "[Ir+3]",
    "[Ir+]",
    "[Ir-4]",
    "[Ir]",
    "[K+]",
    "[K]",
    "[Kr]",
    "[La+3]",
    "[La]",
    "[Li+]",
    "[LiH]",
    "[Li]",
    "[Mg+2]",
    "[Mg+]",
    "[MgH2]",
    "[Mg]",
    "[Mn+2]",
    "[Mn+3]",
    "[Mn+4]",
    "[Mn+6]",
    "[Mn+]",
    "[Mn]",
    "[Mo+2]",
    "[Mo+4]",
    "[Mo]",
    "[N+3]",
    "[N+]",
    "[N-]",
    "[N@+]",
    "[N@@+]",
    "[N@@H+]",
    "[N@@]",
    "[N@]",
    "[NH+]",
    "[NH-]",
    "[NH2+]",
    "[NH2-]",
    "[NH3+]",
    "[NH4+]",
    "[NH]",
    "[N]",
    "[Na+]",
    "[Na]",
    "[Nb+3]",
    "[Nb+4]",
    "[Nb+5]",
    "[Nb]",
    "[Nd+3]",
    "[Nd+]",
    "[Nd]",
    "[Ni+2]",
    "[Ni+3]",
    "[Ni+4]",
    "[Ni+]",
    "[Ni-]",
    "[NiH6-5]",
    "[Ni]",
    "[O+]",
    "[O-2]",
    "[O-]",
    "[OH+]",
    "[OH-]",
    "[OH2+]",
    "[OH3+]",
    "[OH]",
    "[O]",
    "[Os]",
    "[P+2]",
    "[P+3]",
    "[P+5]",
    "[P+]",
    "[P-3]",
    "[P-]",
    "[P@+]",
    "[P@@+]",
    "[P@@H]",
    "[P@@]",
    "[P@H]",
    "[P@]",
    "[PH+]",
    "[PH2+]",
    "[PH2-]",
    "[PH2]",
    "[PH3+]",
    "[PH3]",
    "[PH4+]",
    "[PH4]",
    "[PH5]",
    "[PH]",
    "[P]",
    "[Pb+2]",
    "[Pb+3]",
    "[Pb+4]",
    "[Pb]",
    "[Pd+2]",
    "[Pd+3]",
    "[Pd+4]",
    "[Pd+]",
    "[Pd-2]",
    "[Pd-3]",
    "[Pd-4]",
    "[Pd-]",
    "[PdH2]",
    "[Pd]",
    "[Pr+3]",
    "[Pr]",
    "[Pt+2]",
    "[Pt+3]",
    "[Pt+4]",
    "[Pt+]",
    "[Pt-2]",
    "[Pt-]",
    "[PtH]",
    "[Pt]",
    "[Ra]",
    "[Rb+]",
    "[Rb]",
    "[Re+5]",
    "[Re+]",
    "[Re]",
    "[Rh+2]",
    "[Rh+3]",
    "[Rh+4]",
    "[Rh+]",
    "[Rh-]",
    "[Rh]",
    "[Ru+2]",
    "[Ru+3]",
    "[Ru+]",
    "[Ru-2]",
    "[Ru-4]",
    "[Ru-]",
    "[Ru]",
    "[S+]",
    "[S-2]",
    "[S-]",
    "[S@+]",
    "[S@@+]",
    "[S@@H]",
    "[S@@]",
    "[S@]",
    "[SH+]",
    "[SH-]",
    "[SH2+]",
    "[SH2]",
    "[SH3+]",
    "[SH3]",
    "[SH]",
    "[S]",
    "[Sb+2]",
    "[Sb+3]",
    "[Sb+5]",
    "[Sb+]",
    "[Sb-]",
    "[Sb]",
    "[Sc+3]",
    "[Sc]",
    "[Se+]",
    "[Se-2]",
    "[Se-]",
    "[SeH+]",
    "[SeH-]",
    "[SeH2]",
    "[SeH]",
    "[Se]",
    "[Si+2]",
    "[Si+4]",
    "[Si+]",
    "[Si-]",
    "[Si@@H]",
    "[Si@@]",
    "[Si@H]",
    "[Si@]",
    "[SiH-]",
    "[SiH2]",
    "[SiH3-]",
    "[SiH3]",
    "[SiH4]",
    "[SiH]",
    "[Si]",
    "[Sm+2]",
    "[Sm+3]",
    "[Sm]",
    "[Sn+2]",
    "[Sn+3]",
    "[Sn+4]",
    "[Sn+6]",
    "[Sn+]",
    "[Sn-]",
    "[SnH2+]",
    "[SnH2]",
    "[SnH3]",
    "[SnH4+2]",
    "[SnH4]",
    "[SnH6+3]",
    "[SnH]",
    "[Sn]",
    "[Sr+2]",
    "[SrH2]",
    "[Sr]",
    "[Ta+2]",
    "[Ta+5]",
    "[TaH3]",
    "[Ta]",
    "[Tb+3]",
    "[Tb]",
    "[Tc+6]",
    "[Tc]",
    "[Te-]",
    "[TeH2]",
    "[TeH]",
    "[Te]",
    "[Th]",
    "[Ti+2]",
    "[Ti+3]",
    "[Ti+4]",
    "[Ti+5]",
    "[Ti+]",
    "[Ti]",
    "[Tl+2]",
    "[Tl+3]",
    "[Tl+]",
    "[Tl]",
    "[U+2]",
    "[U+4]",
    "[U+6]",
    "[U]",
    "[V+2]",
    "[V+3]",
    "[V+4]",
    "[V+5]",
    "[V+]",
    "[V]",
    "[W+6]",
    "[W-2]",
    "[W]",
    "[Xe]",
    "[Y+3]",
    "[Y]",
    "[Yb+2]",
    "[Yb+3]",
    "[Yb]",
    "[Zn+2]",
    "[Zn+]",
    "[Zn]",
    "[Zr+2]",
    "[Zr+3]",
    "[Zr+4]",
    "[Zr+]",
    "[Zr]",
    "[b-]",
    "[c+]",
    "[c-]",
    "[cH+]",
    "[cH-]",
    "[n+]",
    "[n-]",
    "[nH+]",
    "[nH]",
    "[o+]",
    "[p+]",
    "[pH]",
    "[s+]",
    "[sH+]",
    "[se+]",
    "[se]",
    "[siH]",
    "[te+]",
    "[te]",
    "\\",
    "b",
    "c",
    "n",
    "o",
    "p",
    "s",
    "se",
    "te",
    "~"
  ],
  "metadata": {
    "total_tokens": 775636407,
    "unique_tokens": 604,
    "total_smiles_processed": 14901577,
    "created_date": "2025-12-16 21:51:08",
    "source": "from_file",
    "charset": "SMILES"
  }
}